system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      http://www.cfdyna.com                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-10     10      0)      // 0
    (-10    -10      0)      // 1
    ( 10    -10      0)      // 2
    ( 10     10      0)      // 3
    (-17.68  17.68   0)      // 4
    (-17.68 -17.68   0)      // 5
    ( 17.68 -17.68   0)      // 6
    ( 17.68  17.68   0)      // 7
    (-10     10      1000)   // 8
    (-10    -10      1000)   // 9
    ( 10    -10      1000)   // 10
    ( 10     10      1000)   // 11
    (-17.68  17.68   1000)   // 12
    (-17.68 -17.68   1000)   // 13
    ( 17.68 -17.68   1000)   // 14
    ( 17.68  17.68   1000)   // 15
);

blocks
(
    hex (0 1 2 3   8  9 10  11) (10 10 200) simpleGrading (1 1 1)
    hex (0 4 5 1   8  12 13 9 ) (10 10 200) simpleGrading (0.5 1 1)
    hex (1 5 6 2   9  13 14 10) (10 10 200) simpleGrading (0.5 1 1)
    hex (2 6 7 3   10 14 15 11) (10 10 200) simpleGrading (0.5 1 1)
    hex (3 7 4 0   11 15 12 8 ) (10 10 200) simpleGrading (0.5 1 1)
);

edges
(
    arc 4  5  (-25  0   0)
    arc 5  6  ( 0  -25  0)
    arc 6  7  ( 25  0   0)
    arc 7  4  ( 0   25  0)
    arc 12 13 (-25  0   1000)
    arc 13 14 ( 0  -25  1000)
    arc 14 15 ( 25  0   1000)
    arc 15 12 ( 0   25  1000)
);

defaultPatch
{
    name wall;
    type wall;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (3 7 4 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8  9  10 11)
            (8  12 13 9)
            (9  13 14 10)
            (10 14 15 11)
            (11 15 12 8)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
